In [1]:
import pandas as pd
import numpy as np
df = pd.read_csv('full.csv')

In [3]:
df.columns

Index(['Identifiant', 'NOM DE FAMILLE', 'Complement du nom', 'Prenom', 'Sexe',
       'Naissance ', 'Deces', 'PERE', 'MERE', 'Frere(s)', 'Sœur(s)',
       'Conjoint', 'Residence'],
      dtype='object')

In [4]:
cols = ['id', 'surname', 'complement', 'name', 'sex', 'birth', 'death',
       'father', 'mother', 'brothers', 'sisters', 'spouse', 'residence']

In [5]:
len(cols) == len(df.columns)

True

In [6]:
df.columns = cols

In [7]:
df.head()

,id,surname,complement,name,sex,birth,death,father,mother,brothers,sisters,spouse,residence
0,1,DE BRUN,DE CASTELLANE,André,M,1659,NaN,10001,10002,NaN,NaN,NaN,NaN
1,2,DE DURAND,SARTOUX,Pierre,M,1616,NaN,11157,11158,14 ; 11252,NaN,NaN,NaN
2,153,DE BADAT,ROUBION,Etienne,M,1580c,NaN,0,0,NaN,NaN,NaN,NaN
3,154,D'AGOULT,OLLIERES,Gaspard,M,NaN,NaN,11379,11380,177,NaN,NaN,NaN
4,177,D'AGOULT,OLLIERES,Melchior,M,NaN,NaN,11379,11380,154,NaN,NaN,NaN

In [8]:
df.shape

(4043, 13)

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4043 entries, 0 to 4042
Data columns (total 13 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   id          4043 non-null   int64
 1   surname     3871 non-null   object
 2   complement  2495 non-null   object
 3   name        3866 non-null   object
 4   sex         4037 non-null   object
 5   birth       262 non-null    object
 6   death       274 non-null    object
 7   father      4043 non-null   int64
 8   mother      4043 non-null   int64
 9   brothers    313 non-null    object
 10  sisters     175 non-null    object
 11  spouse      36 non-null     object
 12  residence   1187 non-null   object
dtypes: int64(3), object(10)
memory usage: 410.7+ KB

In [10]:
df = df.drop(columns=['spouse', 'residence'], axis=1)

In [12]:
df.shape

(4043, 11)

In [13]:
df.dropna(how='all', inplace=True)

In [14]:
df.shape

(4043, 11)

In [15]:
df['father'].dtype

dtype('int64')

In [16]:
df.head()

,id,surname,complement,name,sex,birth,death,father,mother,brothers,sisters
0,1,DE BRUN,DE CASTELLANE,André,M,1659,NaN,10001,10002,NaN,NaN
1,2,DE DURAND,SARTOUX,Pierre,M,1616,NaN,11157,11158,14 ; 11252,NaN
2,153,DE BADAT,ROUBION,Etienne,M,1580c,NaN,0,0,NaN,NaN
3,154,D'AGOULT,OLLIERES,Gaspard,M,NaN,NaN,11379,11380,177,NaN
4,177,D'AGOULT,OLLIERES,Melchior,M,NaN,NaN,11379,11380,154,NaN

In [17]:
# 0 == not set
idx = df['father'] == 0
idx2 = df['mother'] == 0
df.loc[idx, 'father'] = np.nan
df.loc[idx2, 'mother'] = np.nan
df[idx & idx2].shape

(2060, 11)

In [18]:
df = df.dropna(subset=['father', 'mother'])

In [19]:
df.shape

(1983, 11)

In [20]:
df['father'].dtype

dtype('float64')

In [21]:
df.loc[:, 'father'] = df.loc[:, 'father'].astype(int)
df.loc[:, 'mother'] = df.loc[:, 'mother'].astype(int)

/var/folders/b3/cjvms6c10k77tgv6k_rw3jbh0000gn/T/ipykernel_31098/2448301576.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.loc[:, 'father'] = df.loc[:, 'father'].astype(int)
/var/folders/b3/cjvms6c10k77tgv6k_rw3jbh0000gn/T/ipykernel_31098/2448301576.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.loc[:, 'mother'] = df.loc[:, 'mother'].astype(int)

In [22]:
df['father'].dtype

dtype('int64')

In [23]:
df['sex'].value_counts()

M    1266
F     717
Name: sex, dtype: int64

In [24]:
df['surname'].isna().sum()

0

In [25]:
df['name'].isna().sum()

0

In [27]:
df['complement'][:5]

0    DE CASTELLANE
1          SARTOUX
3         OLLIERES
4         OLLIERES
5         OLLIERES
Name: complement, dtype: object

In [29]:
df.dropna(subset=['complement'], inplace=True)

In [30]:
df.shape

(1533, 11)

In [32]:
df['brothers'].head()

0           NaN
1    14 ; 11252
3           177
4           154
5           NaN
Name: brothers, dtype: object

In [44]:
# "14 ; 11252" --> "[14, 11252]" <--- python list
import json

def convert_to_json(x):
    if isinstance(x, int) or isinstance(x, float):
        return json.dumps(x)
    try:
        return json.dumps([int(s.strip()) for s in x.split(';')])
    except ValueError:
        return json.dumps(np.nan)

In [45]:
convert_to_json('14 ; 11252')

'[14, 11252]'

In [46]:
tests = list(set(df['brothers'].values.tolist()))
res = list(map(lambda x: convert_to_json(x), tests))
res[:4]

['[178]', '[265, 272]', '[180, 183, 11413]', '[211, 215, 11660, 10829]']

In [41]:
df.loc[df['brothers'] == 'frère chevalier de Malte', :]

,id,surname,complement,name,sex,birth,death,father,mother,brothers,sisters
2301,233,DE VINTIMILLE,MARSEILLE,Jean-Baptiste; Joseph Hubert,M,1740,NaN,11754,11755,frère chevalier de Malte,NaN

In [42]:
df.loc[df['brothers'] == 'frère chevalier de Malte', 'brothers'] = np.nan

In [47]:
df['brothers'] = df['brothers'].apply(lambda x: convert_to_json(x))
df['sisters'] = df['sisters'].apply(lambda x: convert_to_json(x))

In [48]:
df.shape

(1533, 11)

In [49]:
df['brothers'].dtype

dtype('O')

In [50]:
df['birth'].value_counts()

1675     4
1636     4
1666     4
1668     4
1641     3
        ..
1470c    1
1500c    1
1673     1
1544     1
Nice     1
Name: birth, Length: 140, dtype: int64

In [55]:
import re
def convert_date(x):
    pattern = re.compile(r'\d{4}')
    try:
        if re.search(pattern, x):
            return re.search(pattern, x).group()
        else:
            return np.nan
    except TypeError:
        return np.nan

In [56]:
tests = list(set(df['birth'].values.tolist())) # + list(set(df['death'].values.tolist()))
res = list(map(lambda x: convert_date(x), tests))

In [57]:
res[:4]

['1729', '1594', '1614', '1708']

In [58]:
df['birth'] = df['birth'].apply(lambda x: convert_date(x))
df['death'] = df['death'].apply(lambda x: convert_date(x))

In [59]:
df.head()

,id,surname,complement,name,sex,birth,death,father,mother,brothers,sisters
0,1,DE BRUN,DE CASTELLANE,André,M,1659,NaN,10001,10002,NaN,NaN
1,2,DE DURAND,SARTOUX,Pierre,M,1616,NaN,11157,11158,"[14, 11252]",NaN
3,154,D'AGOULT,OLLIERES,Gaspard,M,NaN,NaN,11379,11380,[177],NaN
4,177,D'AGOULT,OLLIERES,Melchior,M,NaN,NaN,11379,11380,[154],NaN
5,11379,D'AGOULT,OLLIERES,Balthazar,M,NaN,NaN,11381,11382,NaN,[11948]

In [60]:
df.to_csv('cleaned.csv', header=True, index=False)